# Напишите функцию-генератор, которая генерирует бесконечную последовательность
# чисел фибоначи
# Распечатайте из этого списка пятое число, двухсотое число, тысячное число,
# стотысячное число
# # На всякий случай, напомню, что превращать результат работы генератора
# в список - неправильно.


import sys
sys.set_int_max_str_digits(1000000)


def fibonacci():
    a, b = 0, 1
    while True:
        yield a
        a, b = b, a + b


# Индексы, которые нужно найти (1-based)
targets = {5, 200, 1000, 100000}
gen = fibonacci()
results = {}

for i in range(1, max(targets) + 1):
    num = next(gen)
    if i in targets:
        print(f"{i}-е число Фибоначчи: {num}")
