# Задание №1 - "Угадайка"
# Создайте такую программу:
# рограмма хранит какую-либо цифру в переменной.
# Программа просит пользователя угадать цифру. Пользователь вводит цифру.
# Программа сравнивает цифру с той, что хранится в переменной.
# Если цифры не равны, программа пишет “попробуйте снова” и снова просит
# пользователя угадать цифру.
# Если пользователь угадывает цифру, программа пишет “Поздравляю! Вы угадали!”
# и завершается.
# Т.е. программа не завершается пока пользователь не угадает цифру.

number = 37
while True:
    user_input = int(input('Введите номер: '))
    if user_input == number:
        print('Поздравляю! Вы угадали!')
        break
    else:
        print('Попробуйте снова')
